Updated readme file with all the important formula and all
